# Описание решения задания для итоговой контрольной по основному блоку #

## Задача: ##
Задача: Написать программу, которая из имеющегося массива строк
формирует новый массив из строк, длина которых меньше, либо равна 3 
символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте 
выполнения алгоритма. При решении не рекомендуется пользоваться 
коллекциями, лучше обойтись исключительно массивами.

## Ввод массива с клавиатуры: ##
Ввод массива с клаиватуры произвела в методе *Creation* где ввела массив типа string и задала размер массива. Далее через цикл for прохожусь по всему массиву от нулевого индекса и значение кождого индекса заполняю с клаввиатуры через метод *Console.ReadLine*. 

## Поиск количества строк размером меньше либо равные 3 и формирование нового массива: ##

В методе *AmtString*  ввожу новую переменную типа int "n" где будет храниться кол-во строк нужного рамера. 
Далее через цикл for прохожусь по всему массиву и задаю условие если hfpvth зничения индекса меньше либо равно 3 то переменная "n" будет увеличиваться на еденицу. Таким образом я узнала сколько строк есть в массиве нужного по условию задачи размера.

Ввожу новый массив rez типа string  размером переменной "n". Далее заданю новую перменную j - индексы массива результата. И опять же через цикл for прохожусь по заданному  массиву с клавиатуры, добавляю условие если размер значения индекса меньше либо равное 3, то в значение под индексом rez[j] буду добавлять значние индекса с нужным размером  из  первоначального массива. И добавляю еденицу к j.

## Печать массива ##
 Первоначальный массив и массив с результом нужно вывести на экран. Для этого я создала метод Print где проходясть  по массивам через цикл for вывожу на экран каждую строку через запятую с помощью метода Console.Write.

 









